# 集合可以用{}或set()创建

# 创建空集合
# 创建空集合必须用set()，{}创建的是空字典
print(type(set()));
print(type({}));

# 创建含有多个元素的集合
a={1,2,3,4,5};
print(type(a));

# 集合是无序的，不能通过序号访问

#集合的特点——唯一性
b={1,1,2,3,2,4,3,4};
print(b);

# 附加
# 去除列表中的重复成员
c=['apple','lemon','lemon','apple'];
print(set(c));

# 集合常见操作
# 1.len()求出集合长度
b={1,1,2,3,2,4,3,4};
print(len(b));

# 2.判断元素是否在集合中
b={1,1,2,3,2,4,3,4};
print(1 in b);
print(5 in b);

# 3.求出集合间的差集
x={1,2,3,4,5};
y={1,2,3,4,5,6,7,8,9};
print(y-x);

# 4.求出集合间的交集
p={5,6,7};
q={9.10,5,7};
print(p & q);

# 5.求出集合间的并集
print(a|b|x|y|p|q);